<dashboard version="1.1" theme="dark" refresh="3">
  <label>SSH-BruteForceDetection</label>
  
  <row depends="$show_css$">
    <panel>
      <html>
        <style>
         
          .dashboard-body, .splunk-dashboard, .main-section-body {
            background: #0a0a0c !important;
          }
          
         
          .dashboard-panel { 
            background: #111116 !important; 
            border: 1px solid #00d4ff !important;
            box-shadow: 0 0 8px rgba(0, 212, 255, 0.1) !important;
          }

         
          .table, .table td, .table th {
            background-color: #111116 !important;
            color: #ffffff !important;
            border-bottom: 1px solid #222 !important;
          }
          
          .table th {
            background: #1a1a20 !important;
            color: #00d4ff !important;
            text-transform: uppercase;
          }
          
         
          .dashboard-row:first-child {
            display: none !important;
          }
        </style>
      </html>
    </panel>
  </row>

  <row>
    <panel width="20">
      <title>ATTACCHI</title>
      <single>
        <search>
          <query>index=main sourcetype=linux_secure "Failed password" | stats count</query>
          <earliest>-24h@h</earliest>
          <latest>now</latest>
        </search>
        <option name="colorMode">none</option>
        <option name="rangeColors">["0x00d4ff","0x00d4ff"]</option>
        <option name="underLabel">FAILED LOGINS</option>
        <option name="height">150</option>
      </single>
    </panel>

    <panel width="80">
      <title>LOG SORGENTI</title>
      <table>
        <search>
          <query>
            index=main sourcetype=linux_secure "Failed password" 
            | rex "from\s+(?&lt;src_ip&gt;[a-f0-9:\.]+)\s+port"
            | table src_ip, _raw
          </query>
          <earliest>-24h@h</earliest>
          <latest>now</latest>
        </search>
        <option name="count">5</option>
        <option name="drilldown">none</option>
        <option name="wrap">false</option>
      </table>
    </panel>
  </row>
</dashboard>
